[
  "「1 乾」 **Chien** : `the vital spirit of heaven` ䷀\n*Force*, *the creative*, *strong action*, *the key*, and *god*.\n```Good fortune is coming your way in anything you do\n\nYour courage and perseverance will reward you with great success If you know how to take your actions and ideals forward with a sense of justice, the forces of Heaven will support you and you will receive the success you desire. Always keep your spirit in harmony with nature.```",
  "「2 坤」 **K'un** : `a multiplicity of things` ䷁\n*Field*, *the receptive*, *acquiescence*, and *the flow*.\n```Troubles and problems are solved with little difficulty\n\nTo not lose the way, you must be patient not to force events. You will obtain great benefits and advantages if you learn how to adapt to various situations, using everyone and without taking initiative. This behaviour will lead you to fulfilling your aims.```",
  "「3 屯」 **Chun** : `difficulty getting started` ䷂\n*Sprouting*, *difficulty at the beginning*, *gathering support*, and *hoarding*.\n```There is a great danger in gossip getting out of hand\n\nIf you wish to undertake something new, you must consider difficulties which will certainly arise, especially at the beginning. Patience and faith in your goals will help you but will not be enough: you must choose someone who can help you and accept the advice of others with benevolence.```",
  "「4 蒙」 **Meng** : `getting caught` ䷃\n*Enveloping*, *youthful folly*, *the young shoot*, and *discovering*.\n```Youthful foolishness. Wasting money. Your life is filled with idle gossip\n\nYou want to reach a goal but in order to do so you will have to trust a Master or guide who will help you overcome obstacles. Initially, you will have the innocence of a child but then, thanks to experience, you will finally reach self-awareness.```",
  "「5 需」 **Hsu** : `waiting` ䷄\n*Attending*, *waiting*, *moistened*, and *arriving*.\n```Happiness is coming. Committed projects are successful\n\nYou must learn how to wait without accelerating time. It is not the right moment to act. You must wait patiently for events to occur until the exact moment for acting arives. Your wait will be useful to relax and collect your strength.```",
  "「6 訟」 **Sung** : `conflict` ䷅\n*Arguing*, *conflict* and *lawsuit*.\n```There are obstacles that block everything you do\n\nEven if you know you are right, stubbornness will cause you harm and conflict. You will have to look for equilibrium and the possibly for meditation to avoid disagreements from occurring. It will be vital for you to recognise the moment to stop, even if it is half way through the journey/project.```",
  "「7 師」 **Shih** : `the mass of humanity` ䷆\n*Leading*, *the army* and *the troops*.\n```Plans find a favourable response\n\nSearch for self-discipline to realise your aims. You must organise and manage all your inner strength to be able to confidently move toward your goals. To keep to schedule, you will have to persist and always be constant.```",
  "「8 比」 **Pi** : `a banding together` ䷇\n*Grouping*, *holding together* and *alliance*.\n```It is important that you unite with others and feel part of a group; this will bring you luck. Approaching friends and people whom you trust helps in moments of need and always gives you great strength. So do not hesitate to put yourself forward in a disinterested way toward others.```",
  "「9 小畜」 **Hsiao Ch'u** : `small involvement` ䷈\n*Small Accumulating*, *the taming power of the small* and *small harvest*.\n```Not a good time to expand. Good time to relax\n\nAt the moment you must wait and occupy yourself only with small things. You will be able to be victorious but you must not display this too much: use this period to analyse everything and be prepared to the best of your ability. Thus, you will gain strength and succeed in your endeavor.```",
  "「10 履」 **Lu** : `smug self-confidence` ䷉\n*Treading*, *treading (conduct)* and *continuing*.\n```You must find the best way to behave toward others. If you learn how to behave correctly, you will manage to conquer those people you want to, whatever their position. Through kindness, you will also gain a great deal from difficult and unpleasant people.```",
  "「11 泰」 **Tai** : `rising above adversity` ䷊\n*Pervading*, *peace* and *greatness*.\n```Relationships enjoy a period of great harmony\n\nThis is a good moment for harmony in which peace, concordance and success govern. If you wish to prosper and be lucky, you will have to maintain this state. Ask help from someone who is capable of stabilising this favourable situation.```",
  "「12 否」 **P'i** : `stagnation` ䷋\n*Obstruction*, *standstill (stagnation)* and *selfish persons*.\n```It is not worth acting in this particular moment as the general situation is not entirely favourable. You will gain more profits by pulling back temporarily and maintaining your independence. Your wisdom now consists in waiting and avoiding the company of unpleasant people.```",
  "「13 同人」 **T'ung Jen** : `people who have affinity with each other` ䷌\n*Concording People*, *fellowship with men* and *gathering men*.\n```To achieve your aims, you will have to unite with virtuous people. Indeed it will be easier to reach every objective if a group of individuals (albeit of different characters), have the same common goal. However, always keep your own personality and act so that you benefit one another.```",
  "「14 大有」 **Ta Yu** : `having great possessions` ䷍\n*Great Possessing*, *possession in great measure* and *the great possession*.\n```What you have lost will return to you\n\nTo win, you must use neither aggression nor arrogance. Indeed, you can obtain great things by being calm. Your attitude of apparent weakness is your strength and nobody can oppose you. Great success is certain to arrive.```",
  "「15 謙」 **Ch'ien** : `holding one's tongue` ䷎\n*Humbling*, *modesty*.\n```Do not forget that in life, nothing remains unchanged and everything evolves through transformation. You must learn how to evaluate every situation with the correct amount of modesty. If you are living a moment of success, re-dimension your enthusiasm; If, on the other hand, you are waiting for some development, be patient; everything turns and re-news itself.```",
  "「16 豫」 **Yu** : `eagerness to start` ䷏\n*Providing-For*, *enthusiasm* and *excess*.\n```If you must lead a group, you must also understand others' intentions and moods. You will be able to fulfil your aims by eliminating every kind of resistance provided that you can understand and go along with everyone. Your enthusiasm will do the rest.```",
  "「17 隨」 **Sui** : `obedient participation` ䷐\n*Following*.\n```This is a time that favours you\n\nIn this particular moment, try not to waste energy in fighting but wait without forcing Destiny's hand. If you learn how to adapt yourself to the situation at hand, by coming to an agreement you will obtain great well-being and assured success.```",
  "「18 蠱」 **Ku** : `inner turmoil` ䷑\n*Correcting*, *work on what has been spoiled*, *decaying* and *branch*.\n```This is the right moment to modify some of your habits. Stagnant situations can only get worse. Eliminate laziness, intervene decisively and resolve any problem within the next few days.```",
  "「19 臨」 **Lin** : `different classes of people` ䷒\n*Nearing*, *approach* and *the forest*.\n```If you want others to approach you, first you must approach them. A positive moment, do not fear anything. Make the most of this as collaboration is very good at this particular time.```",
  "「20 觀」 **Kuan** : `looking, seeing, confronting` ䷓\n*Viewing*, *contemplation (view)* and *looking up*.\n```To take the best decisions, in this phase you must concede all the time necessary to reflect calmly. Evaluate every single aspect of the situation. Observe and understand everything before action.```",
  "「21 噬嗑」 **Shih Ho** : `wrathful` ䷔\n*Gnawing Bite*, *biting through* and *biting and chewing*.\n```The agony of loneliness finds respite\n\nIn this phase, the right way to face the situation is to intervene with decisiveness. It isn't the right time to ignore a problem, or stick your head in the sand. You must re-establish justice, use every means at your disposal: perseverance will help.```",
  "「22 賁」 **Pi** : `grace and beauty` ䷕\n*Adorning*, *grace* and *luxuriance*.\n```Consider beauty and look for it both within yourself and in others. Even though beauty is simply an ornament, its contemplation can bring joy, albeit ephemeral. Highlight your own beauty and admire that of others. That which you focus on, expands.```",
  "「23 剝」 **Po** : `finality of death` ䷖\n*Stripping*, *splitting apart* and *flaying*.\n```This is the moment of expectation for you as sometimes danger can be hidden yet it's present, even if you don't see it. Some problems occur inside, in silence. Do not put yourself forward and take no decisions. Postpone everything and retreate into your safe zone.```",
  "「24 復」 **Fu** : `turning back` ䷗\n*Returning*, *return (the turning point)*.\n```Even a friend can become an enemy. You need patience for this time of confusion\n\nAfter a period of darkness, the light always returns; now you can face a new phase of renewal. This is the right moment as you will be able to regenerate yourself. There will be no resistance on your path toward success.```",
  "「25 無妄」 **Wu Wang** : `innocence` ䷘\n*Without Embroiling*, *innocence (the unexpected)* and *pestilence*.\n```Your lover is betraying you, be careful\n\nListen to what your internal voice suggests and go forward doing things you know are right. Do not act for a particular aim, or hoping for a financial reward. Be simple and listen to your profound inner-Being. Act freely and with serenity.```",
  "「26 大畜」 **Ta Ch'u** : `big involvement` ䷙\n*Great Accumulating*, *the taming power of the great*, *great storage*, and *potential energy.*```Clarity emerges where there was confusion\n\nGreat force of spirit and great physical power are hidden inside you. Even if you don't always notice it, this potential is present and you must simply learn to cultivate and discipline it. This is the right moment for using what's inside you.```",
  "「27 頤」 **I** : `nourishment` ䷚\n*Swallowing*, *the corners of the mouth (providing nourishment)*, *jaws* and *comfort/security*.\n```There's an excellent person helping you, a mentor.\n\nNourishment of your body and soul are equally important and correlated to one another. Be careful therefore to look after what you eat and pay great attention to your diet. You are what you eat. You'll understand what are your limits and will find equilibrium.```",
  "「28 大過」 **Ta Kuo** : `great excess` ䷛\n*Great Exceeding*, *preponderance of the great*, *great surpassing* and *critical mass.*```At the moment, events are overpowering and superior to your strength; you cannot win and it is useless to oppose them. You must try to eliminate this obstacle, avoid danger by pulling yourself away from the situation. Be firm and decisive. Learn to say no.```",
  "「29 坎」 **Kan** : `the Abysmal` ䷜\n*Gorge*, *the abyss* (in the oceanographic sense) and *repeated entrapment*.\n```The image of the Abysmal is like seeing a mirage\n\nYou feel you are in the midst of danger and negative circumstances. You must be true to your principles and profound ideals. If you resist with courage and perseverance, being always faithful to your sense of justice, you'll soon be free from this period of adversity.```",
  "「30 離」 **Li** : `clinging` ䷝\n*Radiance*, *the clinging, fire* and *the net*.\n```Even if you have reached success, you must never forget who is present and near you. Those who act in your shadow contribute to sustain your position. There is always reciprocity and relations between people, whatever your level of evolution may be. Do not walk alone.```",
  "「31 咸」 **Hsien** : `something felt in the heart` ䷞\n*Conjoining*, *influence (wooing)* and *feelings*.\n```This is a favourable moment for you if you wish to start up or improve an emotional relationship. Indeed, now there is great harmony in the cosmos. The situation is favourable for change; this could make your heart and the one of whoever is near you richer.```",
  "「32 恆」 **Heng** : `constancy` ䷟\n*Persevering*, *duration* and *constancy*.\n```Do not interrupt or modify the way you are going. Everything evolves and events run continuously toward their destination. This movement is positive, live it with self-awareness and you'll face all great and small difficulties with ease.```",
  "「33 遯」 **Tun** : `running away` ䷠\n*Retiring*, *retreat* and *yielding*.\n```It's the right moment to step back and observe the situation from outside, in a quiet corner. Renouncing action doesn't mean defeat; instead, it's a sign of great wisdom. Collect your strengths, you will evaluate the current events and intervene at the right moment with great success.```",
  "「34 大壯」 **Ta Chuang** : `great wisdom` ䷡\n*Great Invigorating*, *the power of the great* and *great maturity*.\n```Meetings with friends go smoothly\n\nNow you have the opportunity to obtain your desires and reach your aims. Nothing is impossible as inside you there's great strength and you are fully aware of this. But beware: avoid over-confidence or arrogance and be sure you are always in the right.```",
  "「35 晉」 **Chin** : `meting the great Man` ䷢\n*Prospering*, *progress* and *aquas*.\n```For you, this is a winning moment which you must know how to make the most of. Nothing lasts forever. Remember you will obtain the best results by joining with people who share your interests and aspirations. You will all help one another.```",
  "「36 明夷」 **Ming I** : `a darkening` ䷣\n*Darkening of the Light*, *brilliance injured* and *intelligence hidden*.\n```It is not an easy moment and even if you feel to be in the darkness, light is there, albeit hidden. For now, do not confide your thoughts in those around you. Keep your integrity in silence.```",
  "「37 家人」 **Chia Jen** : `the family type` ䷤\n*Dwelling People*, *the family (the clan)* and *family members*.\n```Try to understand what's your role and position are within the family or social group. In fact, you will get the best results by being faithful to your current role, contributing to the well-being of others.```",
  "「38 睽」 **Kuei** : `opposition` ䷥\n*Polarising*, *opposition* and *perversion*.\n```It is not worth trying to harmonise things, people or situations which are simply not compatible. Remember, everyone has different personalities and it's important for you to maintain yours. You can find a harmonious way, even if this is in the distant future.```",
  "「39 蹇」 **Chien** : `grave danger` ䷦\n*Limping*, *obstruction* and *afoot*.\n```This is not the right moment to act; there are difficulties and it's worth it for you to stop and reflect. When something doesn’t work, do not blame someone else, instead, look for possible causes within you. Remember that you can always lean on someone you have trusted for some time now.```",
  "「40 解」 **Hsieh** : `liberation`\n*Taking-Apart*, *deliverance* and *untangled*.\n```Your social life takes-off, suddenly you are very popular\n\nThis is the moment when adversities will be overcome. You'll realise that all problems are now behind you and that soon the road back to normality will be free. When you finally have victory, try not to show any form of rancour.```",
  "「41 損」 **Sun** : `loss` ䷨\n*Diminishing*, *decrease*.\n```In this period, you must try to eliminate all which is superficial in favour of what is essential. You must not consider this as a loss, because what you lose on one hand, you gain on another. To be lucky, you must concentrate only on what is really useful.```",
  "「42 益」 **I** : `increase` ䷩\n*Augmenting*, *increase*.\n```Misfortune transforms into good fortune\n\nMake the most of this moment to grow and evolve. Now you can work on spiritual elevation and reach important goals. Remember you will grow more quickly if you help people who need you.```",
  "「43 夬」 **Kuai** : `determination` ䷪\n*Displacement*, *resoluteness*, *parting*, and *break-through*.\n```Determination gets you everywhere, it reaps you benefits\n\nNow you can finally take that decision which puts an end to a current hostile and unfavourable situation. Remember that it'll be enough for you to make the first step, the rest will come along. Take this opportunity and correct once and for all everything which is not right around you.```",
  "「44 姤」 **Kou** : `an encounter` ䷫\n*Coupling*, *coming to meet* and *meeting*.\n```An unexpected encounter is likely to take place. Don't go on the first impression. Try to understand what's hidden beneath the external veil. Try to avoid dangers and you'll obtain advantages and long-term success.```",
  "「45 萃」 **Ts'ui** : `gathering` ䷬\n*Clustering*, *gathering together (massing)* and *finished*.\n```Now is a good time to meet others and make projects together. Remember that in a group you must always consider different ideas and expectations. Avoid all pretensions.```",
  "「46 升」 **Sheng** : `ascending` ䷭\n*Ascending*, *pushing upward*.\n```Fear nothing, for this is a favourable moment. You can reach high slowly and with constancy. Along the way you'll meet important and influential people. If they deserve your trust, treasure their example and advice.```",
  "「47 困」 **K'un** : `oppression` ䷮\n*Confining*, *oppression (exhaustion)* and *entangled*.\n```Don't give up, even if something is worrying you. Make the most of this circumstance and transform every difficulty into a stimulus so that you can go ahead. Have faith in destiny which always changes bad into good. Luck is for the bravest!```",
  "「48 井」 **Ching** : `the well` ䷯\n*Welling*, *the well*.\n```External circumstances regularly change quickly. You must consider however that the most intimate essence of man is unchanged over time. Give what you have to grow. Try to help others as well as you can.```",
  "「49 革」 **Ko** : `revolution` ䷰\n*Skinning*, *revolution (molting)* and *the bridle*.\n```There will be a radical change which will let you make the most of renewing the current state of affairs. Be careful to consider others' needs, not just your own. In this way you'll reach your objective with serenity.```",
  "「50 鼎」 **Ting** : `the cauldron` ䷱\n*Holding*, *the cauldron*.\n```A lucky moment with positive and favourable external forces. Remember however that he or she who is in a privileged position must be attentive to those who are not as fortunate.```",
  "「51 震」 **Chen** : `thunder` ䷲\n*Shake*, *the arousing (shock, thunder)* and *thunder*.\n```Influential friends help and protect you\n\nAn event will occur which will change the actual state of the things and the current situation. Make the most of this change by being calm. This will help you strengthen your character and make you wise and virtuous.```",
  "「52 艮」 **ken** : `stillness` ䷳\n*Bound*, *keeping still, mountain* and *stilling*.\n```Don't run away from situations and don't avoid what could be a problem. Now it is opportune for you to stop and observe things as they really are. This moment of calm and reflection will give you the necessary awareness to go forward in the future.```",
  "「53 漸」 **Chien** : `gradual development` ䷴\n*Infiltrating*, *development (gradual progress)* and *advancement*.\n```To obtain what you want, you must proceed gradually. Do not try to rush things or be taken by enthusiasm. To reach the desired results, go forward calm and with constancy; on the way you will med your errors.```",
  "「54 歸妹」 **Kuei Mei** : `marrying girl` ䷵\n*Converting the Maiden*, *the marrying maiden* and *returning maiden*.\n```In your social relations, both friendships and love affairs, you must always respect fundamental rules. The ones which establish the different roles people have. Try therefore to proceed with the right amount of discretion, avoiding difficulties and paving he way for success.```",
  "「55 豐」 **Feng** : `greatness` ䷶\n*Abounding*, *abundance* and *fullness*.\n```For you, this is the moment for great fortune and prosperity. You can reach your objectives and success. Make the most of this lucky situation. Remember that great opportunities only come round once and you must not let them slip away.```",
  "「56 旅」 **Lu** : `the exile` ䷷\n*Sojourning*, *the wanderer* and *traveling*.\n```Now is not the moment for starting projects; consider how everything is changeable and prone to transformation. For the moment you must rely on what you have and make it suffice. Free yourself from the sense of possessions and expectations which poison life.```",
  "「57 巽」 **Sun** : `the wind` ䷸\n*Ground*, *the gentle (the penetrating, wind)* and *calculations*.\n```In this period, your doubts dissipate and problems are resolved. The best way to see clearly is to observe the situation. Everything will sort itself out.```",
  "「58 兌」 **Tui** : `joyousness` ䷹\n*Open*, *the joyous, lake* and *usurpation*.\n```In this period, you can overcome all your difficulties with cheerfulness and lightheartedness. You'll enjoy being with others. Share this positive energy with everyone; there is great harmony inside you and you must learn to appreciate and enjoy it.```",
  "「59 渙」 **Huan** : `dispersion` ䷺\n*Dispersing*, *dispersion (dissolution)* and *dispersal*.\n```You will get the impression that something is preventing you from reaching your aims. This could be because of your indifference or coldness towards others. So it's important you relax and get rid of all your tension: then you will be able to open up to others.```",
  "「60 節」 **Chieh** : `limitation` ䷻\n*Articulating*, *limitation* and *moderation*.\n```In this period, self control and self-discipline are fundamental. Only in this way will you be able to achieve your all and avoid any harm. Do not follow your instincts but try to limit yourself to always keeping in mind boundaries you must not cross.```",
  "「61 中孚」 **Chung Fu** : `inner truth` ䷼\n*Center Returning*, *inner truth* and *central return*.\n```If you want a good and satisfying relationship with people around you, sincerity and honesty are important. Do not be silent, even with those who are different from you. Be available and let others approach you with joy and spontaneity.```",
  "「62 小過」 **Hsiao Kuo** : `small error/weakness` ䷽\n*Small Exceeding*, *preponderance of the small* and *small surpassing*.\n```It is not the right moment to accomplish great undertakings. In fact, now you can obtain something by moving slowly and being constant. Be content with your position and in this way you'll go far.```",
  "「63 既濟」 **Chi Chi** : `completion` ䷾\n*Already Fording*, *after completion* and *already completed* or *already done*.\n```Finally, you have achieved what you desired. Your objective and success have been reached, At this point you must simply refine some particulars. You must maintain what you have built: everything changes and so it'll be necessary to be careful that you don't lose everything.```",
  "「64 未濟」 **Wei Chi** : `before completion` ䷿\n*Not Yet Fording*, *before completion* and *not yet completed*.\n```Sadness. A period of misfortune that lasts 28 days\n\nThis period is full of useful opportunities for you to achieve what you want. This is a transitional phase which can move you from a negative problematic phase to a positive serene phase. Continue to be prudent: success is in your hands and nearby.```",
  "「0」 **Ling** : `zero answer`\n```tis' not the best time to ask\n\nAnswers are not received.```",
  "「x」**Zaici** : `ask again`\n```Wasn't able to get an answer at this moment\n\nBreathe and ask again.```"
]
